// 1. Користувач вводить або має два числа.  Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let num1 = +prompt('Введіть ціле число num1');
// let num2 = +prompt('Введіть ціле число num2');
// if (num1 > num2) {
//     console.log(num1);
// } else if (num1 <num2) {
//     console.log(num2);
// } else {
//     console.log('ведені числа рівні');
// }

// 2. У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let flat = +prompt('Введіть номер квартири!');
// if (flat < 1 || flat > 90) {
//     console.log("Номер квартири введено некоректно");
// } else if (flat <= 20) {
//     console.log("Це 1-й під'їзд");
// } else if (flat <= 48) {
//     console.log("Це 2-й під'їзд");
// } else {
//     console.log("Це 3-й під'їзд");
// }

// 3. Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
//     якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('Введіть число!');
// if (number === 10) {
//     console.log('ВІРНО');
// } else {
//     console.log('НЕВІРНО');
// }





// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


// 5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
